app/Helpers/costume_helper.php

SELECT *
FROM `user`
WHERE `username` = 'Fakhri'
---
function userlogin()
{
    $db = \Config\Database::connect();
    return $db->table('user')->where('username', session('username'))->get()->getRow();