app/Models/M_Siswa.php

    public function detail_Data2($id_file)
    {
        return $this->db->table('data_penelitian')->where('id', $id_file)->get()->getRowArray();
---
SELECT *
FROM `data_penelitian`
WHERE `id` = '67'

    public function getAllData2()
    {
        return $this->db->table('data_penelitian')->get()->getResultArray();
---
SELECT *
FROM `data_penelitian`